In [1]:
import pandas as pd

In [3]:
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import time
import random
import sys

In [4]:
# We create a pandas Series that stores a grocery list
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

In [5]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [6]:
groceries["eggs"]

30

In [10]:
# Series - print attributes - shape, ndim and size
print("The shape of the groceries Series datastructure: ", groceries.shape)
print("Number of dimension of the groceries Series datastructure: ", groceries.ndim)
print("The size of the groceries Series datastructures: ", groceries.size)

The shape of the groceries Series datastructure:  (4,)
Number of dimension of the groceries Series datastructure:  1
The size of the groceries Series datastructures:  4

In [11]:
# Value
print(groceries.values)

[30 6 'Yes' 'No']

In [12]:
# Indices
print(groceries.index)

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [13]:
# Check if value exists in a Series
y = 'bananas'  in groceries

In [14]:
y

False

In [15]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [16]:
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [19]:
groceries.iloc[[1,0]]

apples     6
eggs      30
dtype: object

In [20]:
groceries.loc[["eggs","apples"]]

eggs      30
apples     6
dtype: object

In [21]:
# dropping values
groceries.drop("apples")

eggs      30
milk     Yes
bread     No
dtype: object

In [22]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [23]:
groceries.drop("apples", inplace=True)

In [24]:
groceries

eggs      30
milk     Yes
bread     No
dtype: object

In [25]:
# Arithmetic operations in series

In [26]:
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

In [27]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [30]:
print(fruits.values)

[10  6  3]

In [29]:
fruits.index

Index(['apples', 'oranges', 'bananas'], dtype='object')

In [31]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [33]:
fruits = fruits + 2

In [34]:
print(fruits)

apples     12
oranges     8
bananas     5
dtype: int64

In [35]:
print(np.exp(fruits))

apples     162754.791419
oranges      2980.957987
bananas       148.413159
dtype: float64

In [36]:
print(np.sqrt(fruits))

apples     3.464102
oranges    2.828427
bananas    2.236068
dtype: float64

In [37]:
print(np.power(fruits, 3))

apples     1728
oranges     512
bananas     125
dtype: int64

In [38]:
series_with_mixed_val = pd.Series(data=[1,2,"apple","banana"])

In [39]:
series_with_mixed_val

0         1
1         2
2     apple
3    banana
dtype: object

In [40]:
series_with_mixed_val = series_with_mixed_val * 2

In [42]:
# From the output of this series the str values are doubled (as per expected behavior)
series_with_mixed_val

0               2
1               4
2      appleapple
3    bananabanana
dtype: object

In [43]:
# We import pandas as pd into Python
import pandas as pd

# We create a dictionary of pandas Series
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# We print the type of items to see that it is a dictionary
print(type(items))

<class 'dict'>

In [47]:
items = pd.DataFrame(items)

In [48]:
items

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [50]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

In [51]:
df = pd.DataFrame(data)

In [52]:
df.head()

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [53]:
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [58]:
print("Shopping cart has shape", df.shape)
print(df.ndim)
print(df.size) # Number of elements
print(df.values)
print(df.index)
print(df.columns)

Shopping cart has shape (4, 2)
2
8
[[245.  40.]
 [ 25. 110.]
 [ 55. 500.]
 [ nan  45.]]
RangeIndex(start=0, stop=4, step=1)
Index(['Bob', 'Alice'], dtype='object')

In [59]:
# Accessing values of a dataframe we use - dataframe[column][row]
# You can append a dataframe to a data frame using df.append(new_df_name)
# dataframe.insert(location, label, data)
# store_items.insert(5, 'shoes', data_array)
# dataframe POP - store_items.pop('new watches') - Removes column

# dataframe.drop(columns_index, axis)
# dataframe.drop(row_index, axis)
# You can rename columns using df.rename(columns={'original_name':'replacement_name'})
# You can also rename the row lables df.rename(index={'original_index_name':'new_index_name'})

In [60]:
items = [{'bikes': 20, 'pants': 30, 'goods': 40, 'socks':60}, {'bread': 20, 'pants': 30, 'goods': 40, 'socks':60}, {'bikes': 20, 'socks': 30, 'goods': 40, 'socks':60}]

df = pd.DataFrame(index=['store_1', 'store_2', 'store_3'], data=items)
df.head()

         bikes  pants  goods  socks  bread
store_1   20.0   30.0     40     60    NaN
store_2    NaN   30.0     40     60   20.0
store_3   20.0    NaN     40     60    NaN

In [62]:
df.isnull().sum()

bikes    1
pants    1
goods    0
socks    0
bread    2
dtype: int64

In [65]:
df.dropna(axis=1) # axis = 0 columns are deleted

         goods  socks
store_1     40     60
store_2     40     60
store_3     40     60

In [66]:
df = df.fillna(method='ffill', axis=1)

In [67]:
df

         bikes  pants  goods  socks  bread
store_1   20.0   30.0   40.0   60.0   60.0
store_2    NaN   30.0   40.0   60.0   20.0
store_3   20.0   20.0   40.0   60.0   60.0

In [68]:
df = df.interpolate(method='linear', axis=1)

In [69]:
df

         bikes  pants  goods  socks  bread
store_1   20.0   30.0   40.0   60.0   60.0
store_2    NaN   30.0   40.0   60.0   20.0
store_3   20.0   20.0   40.0   60.0   60.0

In [71]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

In [72]:
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

In [73]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [74]:
store_items.isnull().sum().sum()

3

In [75]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [76]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [77]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [78]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [79]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [80]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [81]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [82]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [83]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [84]:
# Setting dataframe precision to 1 decimal place = pd.set_option('precision', 1)

In [86]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books.
# The ratings given are in the range from 1 to 5, with 5 being the best score.
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'.
# Let Pandas automatically assign numerical row indices to the DataFrame.

# TO DO: Create a dictionary with the data given above
dat = {
    "Author": authors,
    "Book Title": books,
    "User 1": user_1,
    "User 2": user_2,
    "User 3": user_3,
    "User 4": user_4
}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)

# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels:
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place.
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values.
# Write your code below:
book_ratings["User 1"].fillna(book_ratings["User 1"].mean(),inplace=True)
book_ratings["User 2"].fillna(book_ratings["User 2"].mean(),inplace=True)
book_ratings["User 3"].fillna(book_ratings["User 3"].mean(),inplace=True)

In [87]:
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

In [90]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

In [91]:
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [92]:
google_stock = pd.read_csv("goog-1.csv")

In [93]:
google_stock

            Date   Open   High    Low  Close  Adj Close    Volume
0     2004-08-19   49.7   51.7   47.7   49.8       49.8  44994500
1     2004-08-20   50.2   54.2   49.9   53.8       53.8  23005800
2     2004-08-23   55.0   56.4   54.2   54.3       54.3  18393200
3     2004-08-24   55.3   55.4   51.5   52.1       52.1  15361800
4     2004-08-25   52.1   53.7   51.6   52.7       52.7   9257400
...          ...    ...    ...    ...    ...        ...       ...
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0    891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6    968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2   1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8   1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7   1157700

[3313 rows x 7 columns]

In [94]:
google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [95]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [96]:
google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [97]:
google_stock.mean()

C:\Users\billy\AppData\Local\Temp/ipykernel_3604/2995703419.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  google_stock.mean()

Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

In [98]:
fake_data = pd.read_csv("fake-company.csv")

In [99]:
fake_data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [101]:
fake_data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [102]:
google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [103]:
google_stock.isnull().count()

Date         3313
Open         3313
High         3313
Low          3313
Close        3313
Adj Close    3313
Volume       3313
dtype: int64

In [104]:
google_stock.value_counts()

Date        Open   High   Low    Close  Adj Close  Volume
2004-08-19  49.7   51.7   47.7   49.8   49.8       44994500    1
2013-06-05  428.5  431.9  425.8  427.1  427.1      4240900     1
2013-05-21  451.1  452.9  445.9  450.6  450.6      3991600     1
2013-05-22  448.4  451.7  440.6  441.8  441.8      5154400     1
2013-05-23  435.7  442.1  434.2  438.5  438.5      4579700     1
                                                              ..
2009-01-12  157.1  158.4  154.1  155.3  155.3      6651500     1
2009-01-13  154.9  159.3  154.2  156.1  156.1      8922500     1
2009-01-14  154.0  155.9  147.9  149.5  149.5      11006800    1
2009-01-15  147.8  150.8  142.5  148.5  148.5      11946100    1
2017-10-13  992.0  997.2  989.0  989.7  989.7      1157700     1
Length: 3313, dtype: int64

In [105]:
def chunker(iterable, size):
    """Yield successive chunks from iterable of length size."""
    for i in range(0, len(iterable), size):
        yield iterable[i:i + size]

for chunk in chunker(range(25), 4):
    print(list(chunk))

[0, 1, 2, 3]
[4, 5, 6, 7]
[8, 9, 10, 11]
[12, 13, 14, 15]
[16, 17, 18, 19]
[20, 21, 22, 23]
[24]

In [107]:
len([0, 1] * 100)

200

In [5]:
import numpy as np

NameError: name 'random' is not defined